/**@file

 @copyright
  INTEL CONFIDENTIAL
  Copyright 2009 - 2016 Intel Corporation.

  The source code contained or described herein and all documents related to the
  source code ("Material") are owned by Intel Corporation or its suppliers or
  licensors. Title to the Material remains with Intel Corporation or its suppliers
  and licensors. The Material may contain trade secrets and proprietary and
  confidential information of Intel Corporation and its suppliers and licensors,
  and is protected by worldwide copyright and trade secret laws and treaty
  provisions. No part of the Material may be used, copied, reproduced, modified,
  published, uploaded, posted, transmitted, distributed, or disclosed in any way
  without Intel's prior express written permission.

  No license under any patent, copyright, trade secret or other intellectual
  property right is granted to or conferred upon you by disclosure or delivery
  of the Materials, either expressly, by implication, inducement, estoppel or
  otherwise. Any license under such intellectual property rights must be
  express and approved by Intel in writing.

  Unless otherwise agreed by Intel in writing, you may not remove or alter
  this notice or any other notice embedded in Materials by Intel or
  Intel's suppliers or licensors in any way.

  This file contains a 'Sample Driver' and is licensed as such under the terms
  of your license agreement with Intel or your vendor. This file may be modified
  by the user, subject to the additional terms of the license agreement.

@par Specification
**/

//
// Name:        MeSetup.UNI
//
// Description: ME Form String Definitions.
//
//**********************************************************************
//**********************************************************************
/=#

#include "VFR.uni"

#langdef   x-AMI "AmiMappingLanguage"           // AMI Mapping Language


#string STR_ENABLED                           #language en-US "Enabled"
#string STR_DISABLED                          #language en-US "Disabled"

#string STR_ME_FORM                           #language en-US "PCH-FW Configuration"
                                              #language x-AMI "RCME001"
#string STR_ME_FORM_HELP                      #language en-US "Configure Management Engine Technology Parameters"

//---------------------------------------------------------------------------
// ME Configuration
//---------------------------------------------------------------------------

#string STR_ME_FW_VERSION_HELP                #language en-US  "ME Firmware Version"
#string STR_ME_FW_VERSION_PROMPT              #language en-US  "ME Firmware Version"
#string STR_ME_FW_VERSION_VALUE               #language en-US  "N/A" //dynamically updated

#string STR_ME_FW_MODE_HELP                   #language en-US  "ME Firmware Mode"
#string STR_ME_FW_MODE_PROMPT                 #language en-US  "ME Firmware Mode"
#string STR_ME_FW_MODE_VALUE                  #language en-US  "N/A" //dynamically updated
#string STR_ME_FW_MODE_NORMAL_MODE            #language en-US  "Normal Mode"
#string STR_ME_FW_MODE_FAILED                 #language en-US  "ME Failed"
#string STR_ME_FW_MODE_TEMP_DISABLED          #language en-US  "ME Temporarily Disabled"
#string STR_ME_FW_MODE_SECOVER                #language en-US  "Secovr Jmpr/Heci MSG"
#string STR_ME_FW_MODE_ALT_DISABLED           #language en-US  "ME ALT Disabled"

#string STR_ME_FW_SKU_HELP                    #language en-US  "ME Firmware SKU"
#string STR_ME_FW_SKU_PROMPT                  #language en-US  "ME Firmware SKU"
#string STR_ME_FW_SKU_VALUE                   #language en-US  "N/A" //dynamically updated

#string STR_ME_FILE_SYSTEM_CORRUPTION_HELP    #language en-US  "ME File System Integrity Value"
#string STR_ME_FILE_SYSTEM_CORRUPTION_PROMPT  #language en-US  "ME File System Integrity Value"
#string STR_ME_FILE_SYSTEM_CORRUPTION_VALUE   #language en-US  "N/A" //dynamically updated

#string STR_ME_FW_STATUS_1_HELP               #language en-US  "ME Firmware Status 1"
#string STR_ME_FW_STATUS_1_PROMPT             #language en-US  "ME Firmware Status 1"
#string STR_ME_FW_STATUS_1_VALUE              #language en-US  "N/A" //dynamically updated

#string STR_ME_FW_STATUS_2_HELP               #language en-US  "ME Firmware Status 2"
#string STR_ME_FW_STATUS_2_PROMPT             #language en-US  "ME Firmware Status 2"
#string STR_ME_FW_STATUS_2_VALUE              #language en-US  "N/A" //dynamically updated

//---------------------------------------------------------------------------
// ME State control definitions
//---------------------------------------------------------------------------

#string STR_ME_STATE_CONTROL_PROMPT           #language en-US "ME State"
                                              #language x-AMI "RCME002"
#string STR_ME_STATE_CONTROL_HELP             #language en-US "When Disabled ME will be put into ME Temporarily Disabled Mode."

//---------------------------------------------------------------------------
// Manageability Features State definitions
//---------------------------------------------------------------------------

#string STR_MNG_STATE_PROMPT                  #language en-US "Manageability Features State"
                                        #language x-AMI "RCME003"
#string STR_MNG_STATE_HELP                    #language en-US "Enable/Disable Intel(R) Manageability features.\n\nNOTE:\nThis option disables/enables Manageability Features support in FW.\nTo disable support platform must be in an unprovisioned state first."

//---------------------------------------------------------------------------
// AMT BIOS Features definitions
//---------------------------------------------------------------------------

#string STR_AMT_PROMPT                        #language en-US "AMT BIOS Features"
                                              #language x-AMI "RCME004"
#string STR_AMT_HELP                          #language en-US "When disabled AMT BIOS Features are no longer supported and user is no longer able to access MEBx Setup.\n\nNote:\nThis option does not disable Manageability Features in FW."

//---------------------------------------------------------------------------
// ME Unconfig on RTC Clear State Definitions
//---------------------------------------------------------------------------
#string STR_ME_UNCONF_RTC_STATE_PROMPT        #language en-US "ME Unconfig on RTC Clear"
                                              #language x-AMI "RCME006"
#string STR_ME_UNCONF_RTC_STATE_PROMPT_HELP   #language en-US "When Disabled ME will not be unconfigured on RTC Clear"

//---------------------------------------------------------------------------
// NFC definitions
//---------------------------------------------------------------------------

#string STR_NFC_PROMPT                        #language en-US "NFC Support"
#string STR_NFC_HELP                          #language en-US "Enables support for NFC."
#string STR_NFC_STATE_VALUE                   #language en-US "N/A" //dynamically updated"

#string STR_NFC_STATE_PROMPT                  #language en-US "NFC Feature State"
                                              #language x-AMI "RCME007"
#string STR_NFC_STATE_HELP                    #language en-US "Enable/Disable NFC Feature"

//---------------------------------------------------------------------------
// Comms Hub definitions
//---------------------------------------------------------------------------

#string STR_COMMS_HUB_PROMPT                  #language en-US "Comms Hub Support"
                                              #language x-AMI "RCME008"
#string STR_COMMS_HUB_HELP                    #language en-US "Enables/Disables support for Comms Hub."


//---------------------------------------------------------------------------
// JHI control Definitions
//---------------------------------------------------------------------------
#string STR_ME_JHI_CONTROL_PROMPT             #language en-US "JHI Support"
                                              #language x-AMI "RCME009"
#string STR_ME_JHI_CONTROL_PROMPT_HELP        #language en-US "Enable/Disable Intel(R) DAL Host Interface Service (JHI)"

//---------------------------------------------------------------------------
// Core Bios Done Message Definitions
//---------------------------------------------------------------------------
#string STR_ME_CORE_BIOS_DONE_PROMPT          #language en-US  "Core Bios Done Message"
                                              #language x-AMI "RCME00A"
#string STR_ME_CORE_BIOS_DONE_HELP            #language en-US  "Enable/Disable Core Bios Done message sent to ME"


//---------------------------------------------------------------------------
// Debug Configuration Menu
//---------------------------------------------------------------------------

#string STR_ME_DEBUG_CONFIGURATION_FORM       #language en-US  "ME Debug Configuration"
                                              #language x-AMI "RCME00D"
#string STR_ME_DEBUG_CONFIGURATION_FORM_HELP  #language en-US  "Configure ME debug options\n\nNOTE:\nThis menu is provided for testing purposes. It is recommended to leave the options in their default states"

//---------------------------------------------------------------------------
// End of Post Message Definitions
//---------------------------------------------------------------------------
#string STR_END_OF_POST_PROMPT                #language en-US  "End Of Post Message"
                                              #language x-AMI "RCME00T"
#string STR_END_OF_POST_HELP                  #language en-US  "Enable/Disable End of Post message sent to ME"
#string STR_END_OF_POST_SEND_IN_DXE           #language en-US  "Send in DXE"

//---------------------------------------------------------------------------
// FW Update Configuration Menu
//---------------------------------------------------------------------------

#string STR_FW_UPGRADE_FORM                   #language en-US  "Firmware Update Configuration"
                                              #language x-AMI "RCME00B"
#string STR_FW_UPGRADE_FORM_HELP              #language en-US  "Configure Management Engine Technology Parameters"

#string STR_AMT_ME_FW_DOWNGRADE_PROMPT        #language en-US  "Me FW Image Re-Flash"
                                              #language x-AMI "RCME00H"
#string STR_AMT_ME_FW_DOWNGRADE_HELP          #language en-US  "Enable/Disable Me FW Image Re-Flash function."

#string STR_AMT_LOCAL_FW_UPDATE_PROMPT        #language en-US  "Local FW Update"
                                              #language x-AMI "RCME00I"
#string STR_AMT_LOCAL_FW_UPDATE_HELP          #language en-US  "Options for Local FW Update function."

//---------------------------------------------------------------------------
// PTT Configuration Menu
//---------------------------------------------------------------------------

#string STR_ME_PTT_CONFIGURATION_FORM         #language en-US  "PTT Configuration"
                                              #language x-AMI "RCME00C"
#string STR_ME_PTT_CONFIGURATION_FORM_HELP    #language en-US  "Configure PTT"

//---------------------------------------------------------------------------
// PTT Switch Definitions
//---------------------------------------------------------------------------

#string STR_PTT_SWITCH_PROMPT                 #language en-US "PTT Switch Selection"
#string STR_PTT_SWITCH_HELP                   #language en-US "Selects the desired PTT solution to be used"
#string STR_GPDMA                             #language en-US "GPDMA Work-Around"
#string STR_MSFT_QFE                          #language en-US "MSFT QFE Solution"

//---------------------------------------------------------------------------
// PTT State Definitions
//---------------------------------------------------------------------------

#string STR_PTT_STATE_PROMPT                  #language en-US  "TPM Device Selection"
#string STR_PTT_STATE_PROMPT_HELP             #language en-US  "Selects TPM device: PTT or discrete TPM.\nPTT - enables PTT in SkuMgr\ndTPM - disables PTT is SkuMgr\n\nWarning!\nPTT/dTPM will be disabled and all data saved on it will be lost."
#string STR_PTT                               #language en-US  "PTT"
#string STR_DTPM                              #language en-US  "dTPM"

#string STR_PTT_CAP_STATE_PROMPT              #language en-US  "PTT Capability / State"
#string STR_PTT_CAP_STATE_VALUE               #language en-US  "N/A"
#string STR_PTT_CAP_STATE_HELP                #language en-US  "Platform Trust Technology Capability / Enablement State"

#string STR_TPM_1_2_DEACTIVATE_PROMPT         #language en-US  "TPM 1.2 Deactivate"
                                              #language x-AMI "RCME00G"
#string STR_TPM_1_2_DEACTIVATE_PROMPT_HELP    #language en-US  "Enabling this option will invoke the TPM 1.2 De-activate flow"

//---------------------------------------------------------------------------
// PTT Revoke Trust Definitions
//---------------------------------------------------------------------------

#string STR_CHANGE_EPS_PROMPT                 #language en-US "Revoke Trust"
#string STR_CHANGE_EPS_HELP                   #language en-US "Sends Change EPS command on next boot"
#string STR_CHANGE_EPS                        #language en-US "Change EPS"
#string STR_DONT_CHANGE_EPS                   #language en-US "Don't Change"

//---------------------------------------------------------------------------
// PTT Ptp Aware OS Definitions
//---------------------------------------------------------------------------

#string STR_PTT_PTP_AWARE_PROMPT              #language en-US "PTP aware OS"
                                              #language x-AMI "RCME00F"
#string STR_PTT_PTP_AWARE_HELP                #language en-US "Select whether or not the OS you will boot to will be PTP aware"
#string STR_PTP_AWARE                         #language en-US "PTP Aware"
#string STR_NOT_PTP_AWARE                     #language en-US "Not PTP Aware"

//---------------------------------------------------------------------------
// Definition for ME test policies
//---------------------------------------------------------------------------

#string STR_HECI_TIMEOUTS_PROMPT                #language en-US  "HECI Timeouts"
                                                #language x-AMI "RCME00J"
#string STR_HECI_TIMEOUTS_HELP                  #language en-US  "Enable/Disable HECI Send/Receive Timeouts."

#string STR_ME_DID_INIT_STAT_PROMPT             #language en-US  "Force ME DID Init Status"
                                                #language x-AMI "RCME00K"
#string STR_ME_DID_INIT_STAT_HELP               #language en-US  "Forces the DID Initialization Status value."
#string STR_ME_DID_INIT_STAT_0                  #language en-US  "0 - Success"
#string STR_ME_DID_INIT_STAT_1                  #language en-US  "1 - No Memory in Channels"
#string STR_ME_DID_INIT_STAT_2                  #language en-US  "2 - Memory Init Error"
#string STR_ME_DID_INIT_STAT_3                  #language en-US  "3 - Memory not preserved across reset"

#string STR_CPU_REPLACED_POLLING_DISABLE_PROMPT #language en-US  "CPU Replaced Polling Disable"
                                                #language x-AMI "RCME00L"
#string STR_CPU_REPLACED_POLLING_DISABLE_HELP   #language en-US  "Setting this option disables CPU replacement polling loop"

#string STR_SEND_ME_DID_MSG_PROMPT              #language en-US  "ME DID Message"
                                                #language x-AMI "RCME00M"
#string STR_SEND_ME_DID_MSG_HELP                #language en-US  "Enable/Disable ME DID Message (disable will prevent the DID message from being sent)."

#string STR_DISABLE_HECI_RETRY_PROMPT           #language en-US  "HECI Retry Disable"
                                                #language x-AMI "RCME00N"
#string STR_DISABLE_HECI_RETRY_HELP             #language en-US  "Setting this option disables retry mechanism for all HECI APIs"

#string STR_DISABLE_MESSAGE_CHECK_PROMPT        #language en-US  "HECI Message check Disable"
                                                #language x-AMI "RCME00O"
#string STR_DISABLE_MESSAGE_CHECK_HELP          #language en-US  "Setting this option disables message check for Bios Boot Path when sending"

#string STR_SKIP_MBP_HOB_PROMPT                 #language en-US  "MBP HOB Skip"
                                                #language x-AMI "RCME00P"
#string STR_SKIP_MBP_HOB_HELP                   #language en-US  "Setting this option will skip MBP HOB"

#string STR_HECI_COMM_PROMPT2                   #language en-US  "HECI2 Interface Communication"
                                                #language x-AMI "RCME00Q"
#string STR_HECI_COMM_HELP2                     #language en-US  "Adds and Removes HECI2 Device from PCI space."

#string STR_KT_DEVICE_ENABLE_PROMPT             #language en-US  "KT Device"
                                                #language x-AMI "RCME00R"
#string STR_KT_DEVICE_ENABLE_HELP               #language en-US  "Enable/Disable KT Device"

#string STR_IDER_DEVICE_ENABLE_PROMPT           #language en-US  "IDER Device"
                                                #language x-AMI "RCME00S"
#string STR_IDER_DEVICE_ENABLE_HELP             #language en-US  "Enable/Disable IDER Device"

#string STR_D0I3_SETTING_DISABLE_PROMPT         #language en-US  "D0I3 Setting for HECI Disable"
                                                #language x-AMI "RCME00U"
#string STR_D0I3_SETTING_DISABLE_HELP           #language en-US  "Setting this option disables setting D0I3 bit for all HECI devices"


// AMI_OVERRIDE_START  
#string STR_TPMDEVICE_SELECTION_PROMPT          #language eng  "TPM Device Selection"
                                                #language x-AMI "RCME00E"
#string STR_TPMDEVICE_SELECTION_HELP            #language eng  "Selects TPM device: PTT or dTPM. PTT - Enables PTT in SkuMgr dTPM 1.2 - Disables PTT in SkuMgr Warning !  PTT/dTPM will be disabled and all data saved on it will be lost."
#string STR_PTT_STRING                          #language eng  "PTT"
#string STR_DTPM_STRING                         #language eng  "dTPM"
// AMI_OVERRIDE_END

// ***Don't modify this line, its automatically generated.?#00U#!***